# PolylineSegments Methods

---
The PolylineSegments type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| GetVertices|  Returns an array of vertices of the polyline segments.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
PolylineSegments Class
Autodesk.Revit.DB Namespace